backend-api/app/Controllers/Barang.php

    public function index()
    {
        // Paksa beri izin CORS langsung saat mengambil data
        header("Access-Control-Allow-Origin: *");
        header("Access-Control-Allow-Headers: X-API-KEY, Origin, X-Requested-With, Content-Type, Accept, Access-Control-Request-Method, Authorization");
        header("Access-Control-Allow-Methods: GET, POST, OPTIONS, PUT, DELETE");

        $model = new BarangModel();
        return $this->respond($model->findAll(), 200);
---
SELECT *
FROM `barang`

    public function insert()
    {
        // PENTING: Paksa inject header CORS di awal fungsi agar browser Chrome langsung lolos!
        header("Access-Control-Allow-Origin: *");
        header("Access-Control-Allow-Headers: X-API-KEY, Origin, X-Requested-With, Content-Type, Accept, Access-Control-Request-Method, Authorization");
        header("Access-Control-Allow-Methods: GET, POST, OPTIONS, PUT, DELETE");

        // Jika browser mengirimkan request ujicoba (OPTIONS), langsung jawab OK (200)
        if ($_SERVER['REQUEST_METHOD'] === 'OPTIONS') {
            return $this->respond(null, 200);
        }

        $model = new BarangModel();
        $json = $this->request->getJSON();

        if ($json) {
            $data = [
                'id_kategori' => isset($json->id_kategori) ? intval($json->id_kategori) : 1,
                'nama_barang' => $json->nama_barang,
                'stok'        => intval($json->stok),
                'supplier'    => $json->supplier
            ];

            $model->insert($data);
---
INSERT INTO `barang` (`id_kategori`, `nama_barang`, `stok`, `supplier`) VALUES (3, 'Buku Catatan Binder A5 Pink', 35, 'Fancy Stationery')